nc: 80
task: classify
backbone:
  - [-1, 1, ConvNormAct, [[16, 3, 2], BatchNorm2d, Hardswish]]  # [[c2, k, ...], BatchNorm2d, Hardswish]
  - [-1, 1, InvertedResidual, [16, 16, 3, 1, 1, false, ReLU]]  # [c2, ce, k, s, d, false, ReLU]
  - [-1, 1, InvertedResidual, [24, 64, 3, 2, 1, false, ReLU]]  # -> C1
  - [-1, 1, InvertedResidual, [24, 72, 3, 1, 1, false, ReLU]]
  - [-1, 1, InvertedResidual, [40, 72, 5, 2, 1, true, ReLU]]  # -> C2
  - [-1, 1, InvertedResidual, [40, 120, 5, 1, 1, true, ReLU]]
  - [-1, 1, InvertedResidual, [40, 120, 5, 1, 1, true, ReLU]]
  - [-1, 1, InvertedResidual, [80, 240, 3, 2, 1, false, Hardswish]]  # -> C3
  - [-1, 1, InvertedResidual, [80, 200, 3, 1, 1, false, Hardswish]]
  - [-1, 1, InvertedResidual, [80, 184, 3, 1, 1, false, Hardswish]]
  - [-1, 1, InvertedResidual, [80, 184, 3, 1, 1, false, Hardswish]]
  - [-1, 1, InvertedResidual, [112, 480, 3, 1, 1, true, Hardswish]]
  - [-1, 1, InvertedResidual, [112, 672, 3, 1, 1, true, Hardswish]]
  - [-1, 1, InvertedResidual, [160, 672, 5, 2, 1, true, Hardswish]]  # -> C4
  - [-1, 1, InvertedResidual, [160, 960, 5, 1, 1, true, Hardswish]]
  - [-1, 1, InvertedResidual, [160, 960, 5, 1, 1, true, Hardswish]]
  - [-1, 1, ConvNormAct, [[960, 1, 1], BatchNorm2d, Hardswish]]
head:
  - [-1, 1, Classifier, [nc, 1280]]