nc: &nc 100
task: classify
backbone:
  - [-1, 1, ConvNormAct, [[16, 3, 2], BatchNorm2d, Hardswish]]  # [[c2, k, ...], BatchNorm2d, Hardswish]
  - [-1, 1, InvertedResidual, [16, 16, 3, 2, 1, true, ReLU]]  # -> C1
  - [-1, 1, InvertedResidual, [24, 72, 3, 2, 1, false, ReLU]]  # -> C2
  - [-1, 1, HadamardResidualV2, [24, 8, 3, 1, 1, false, ReLU]]  # cs: 8, cs_ex: 28, ce: 52
  - [-1, 1, InvertedResidual, [40, 96, 5, 2, 1, true, Hardswish]]  # -> C3
  - [-1, 1, InvertedResidual, [40, 240, 5, 1, 1, true, Hardswish]]
  - [-1, 1, InvertedResidual, [40, 240, 5, 1, 1, true, Hardswish]]
  - [-1, 1, InvertedResidual, [48, 120, 5, 1, 1, true, Hardswish]]
  - [-1, 1, InvertedResidual, [48, 144, 5, 1, 1, true, Hardswish]]
  - [-1, 1, InvertedResidual, [96, 288, 5, 2, 1, true, Hardswish]]  # -> C4
  - [-1, 1, InvertedResidual, [96, 576, 5, 1, 1, true, Hardswish]]
  - [-1, 1, InvertedResidual, [96, 576, 5, 1, 1, true, Hardswish]]
  - [-1, 1, ConvNormAct, [[576, 1, 1], BatchNorm2d, Hardswish]]
head:
  - [-1, 1, Classifier, [*nc, 1024, 0.3]]